docs/04-SolutionArchitecture/GeoGuideAI-Entrega-04.5-Diagramas/01-PlantUML/Data-Model.puml
@startuml
entity User
entity Route
entity PointOfInterest
entity Category
entity Favorite
entity Review
User ||--o{ Route
User ||--o{ Favorite
PointOfInterest }o--|| Category
PointOfInterest ||--o{ Review
PointOfInterest ||--o{ Favorite
@enduml
