docs/04-SolutionArchitecture/GeoGuideAI-Entrega-04.5-Diagramas/05-Sources/Data-Model.dot
digraph G { node [shape=record]; User -> Route; User -> Favorite; PointOfInterest -> Category; PointOfInterest -> Review; PointOfInterest -> Favorite; }
